Repository: MaslovaEV/cloudstack-ui
Catalog: docs/source/locale/*/LC_MESSAGES/*_Overview.po
Languages: ru

source: Overview
ru: Общая информация

source: CloudStack-UI is a project which purpose is to provide an easy-to-use, light, and user-friendly front-end interface for the Apache CloudStack virtualization management system.
ru: CloudStack-UI - это проект, целью которого является разработка более удобного, легкого и интуитивного интерфейса системы управления виртуализацией Apache CloudStack.

source: Apache CloudStack is a great product which is widely used. But its front end is developed for administrators (from our point of view), not for cloud end-users. Some of the interactions are not straightforward and unnatural to an average user and require quite a long time to adapt. Other reasons to develop the UI are connected to the lack of functions like virtual machine statistics & charting, sophisticated resource accounting, and application management.
ru: Apache CloudStack - отличный, часто используемый программный продукт. Но на наш взгляд, при разработке его интерфейса больше ориентировались на Администраторов, а не на пользователей. Некоторое его поведение непонятное и сложное с точки зрения простого пользователя, и требуется некоторое время на его изучение. Кроме того, в нем отсутствует некоторая функциональность, например, статистика работы виртуальных машин, сложный подсчет статистики ресурсов, управление приложениями.

source: That is what we are trying to add to Cloudstack-UI. The work is still in progress. But for now we have already covered lots of features that make CloudStack more good-looking, intuitive and convenient.
ru: Поэтому в Cloudstack-UI мы попытались их добавить. Проект еще находится в разработке, но многое из того, что делает CloudStack более привлекательным, простым и удобным, уже реализовано.

source: Project on `GitHub <https://github.com/bwsw/cloudstack-ui>`_.
ru: См. проект на `GitHub <https://github.com/bwsw/cloudstack-ui>`_.

source: Join the `CloudStack-UI LinkedIn Group <www.linkedin.com/groups/13540203>`_.
ru: Присоединяйтесь к `CloudStack-UI LinkedIn Group <www.linkedin.com/groups/13540203>`_.

source: Project History
ru: История проекта

source: This page provides some background about the project, describes what CloudStack-UI is, and why it was developed.
ru: В данном разделе представлена некоторая информация о проекте, которая дает представление о CloudStack-UI и о причинах для его разработки.

source: At `Bitworks Software <https://bitworks.software/en>`_, we have been running an ACS public cloud for 3 years (actually we still run CS 4.3 cloud in production). And we have found that average users who are familiar with Digital Ocean, Amazon AWS, and other VPS management systems feel uncomfortable with original CloudStack UI and make a lot of operational mistakes. That is why we have decided to implement a convenient and neat end-user facing UI covering regular activities, which are important for day-to-day VM management.
ru: Мы в `Bitworks Software <https://bitworks.software/en>`_ используем публичное облако ACS public cloud уже 3 года (а именно, на данный момент используем облако CS 4.3). И мы подумали, что для рядового пользователя, знакомого с Digital Ocean, Amazon AWS, и другими системами управления VPS может быть неудобно использование оригинального интерфейса CloudStack, что может приводить ко множеству ошибок в работе. Поэтому мы решили применить удобный и привлекательный интерфейс, в котором реализованы основные функции, используемые в ежедневном управлении виртуальными ресурсами.

source: There are several aims we strived to achieve with the new UI:
ru: Ниже приведены некоторые цели, которые мы стремились достичь при разработке интерфейса:

source: The first goal is to make the UI more intuitive in terms of usability, business processes and typical use-cases.
ru: Первая цель состоит в том, чтобы сделать UI более понятным с точки зрения удобства использования и бизнес-процессов.

source: As nowadays people move further from desktop PCs and go full mobile, we wanted the UI to have a support for that. Having a full control of your cloud from a smartphone, what could be better?
ru: Поскольку в наше время люди отходят от настольных PC и чаще используют мобильный телефон, мы хотели, чтобы у UI была реализована поддержка мобильной версии. Ведь здорово иметь полный контроль над Вашим облаком со смартфона?

source: One of the major goals we want to achieve is to build a UI that is possible to support for many years. That’s why we have to use only modern technologies.
ru: Одна из главных целей, которых мы хотим достигнуть, состоит в том, чтобы разработать такой UI, который можно поддерживать длительный срок. Вот почему мы используем только современные технологии.

source: From the technical perspective we also want the UI to support additional meta-information like descriptions, colors, groups, helpers. All of that is not supported by the native UI and it could be used to add some additional semantics to the entities that user has: like Vms, snapshots and so on.
ru: С технической точки зрения мы также хотим, чтобы UI поддерживал возможность добавления дополнительной метаинформации, такой как описание, цвета, группы, помощники. Все это не поддерживается в оригинальном UI, в то время как дополнительная метаинформация может использоваться для добавления некоторой дополнительной семантики к сущностям, имеющимся у пользователя: ВМ, снимки и так далее.

source: The next key point that we wanted to cover with the new UI is to have some extra features beyond the functionality that CloudStack provides, e.g. DNS management, helpdesk integration, PaaS management, runtime statistics charts and monitoring.
ru: Следующим ключевым пунктом является то, что новый UI должен иметь некоторые дополнительные функции вне основной функциональности, которую обеспечивает CloudStack, например, управление DNS, интеграция службы поддержки, управление PaaS, диаграммы статистики во время работы ВМ и контроль ресурсов.

source: And a final goal is to have a community support that could help us to improve the product and provide better user experience for the CloudStack users.
ru: И заключительная цель состоит в том, чтобы получить общественную поддержку, которая могла помочь нам улучшить продукт и обеспечить лучший пользовательский опыт взаимодействия с пользователями CloudStack.

source: Implementation Details
ru: Подробности реализации

source: Designed compatible with Apache CloudStack 4.10 and has been tested for 4.9.
ru: Разработка совместима с Apache CloudStack 4.10, тестирование произведено для версии 4.9.

source: Powered by Angular and Material 2.
ru: Разработано на платформе Angular и Material 2.

source: Tested and works fine in next modern browsers:
ru: Успешно протестировано в следующих браузерах:

source: Documentation
ru: Документация

source: The documentation for the project is presented in the :ref:`CS_User_Guide` that explains to average users how to use the UI when working with CloudStack. It also includes explanations on managers' part clarifying how to manage the cloud infrastructure via CloudStack-UI.
ru: Документация проекта представлена в разделе :ref:`CS_User_Guide_RU`. Она дает пользователю понимание о том, как работать с CloudStack через UI. Также, она включает в себя часть для менеджеров, поясняющую, как лучше управлять инфраструктурой посредством CloudStack-UI.

source: We hope the new features we support will be useful for both end-users and administrators.
ru: Мы надеемся, возможности разработанного интерфейса будут полезны и пользователям, и администраторам.

source: How to Contribute
ru: Как участвовать в проекте

source: CloudStack-UI is an open-source project. It is developed by an open and friendly community. Everybody is welcome to contribute and engage with the community. We are happy to accept any contribution. You can contribute to the project development in various ways:
ru: CloudStack-UI - проект open-source, разработанный открытым и дружным сообществом. Любой может поучаствовать в нем и стать частью сообщества. Мы будем рады любой форме участия. Вы можете:

source: Share the information about the project with other people, try to install the UI and share your opinion with us and your colleagues.
ru: Делиться информацией о проекте, попробовать установить новый UI и поделиться впечатлениями с нами или вашими коллегами.

source: Propose useful features. Ideas are always welcome.
ru: * Предложить полезную функциональность. Мы всегда рады идеям!

source: Deploy it somewhere and inform us about your success story and we will share it in the adopters section.
ru: * Развернуть UI в своем окружении и поделиться этим опытом.

source: Fix bugs and send us the PR.
ru: * Править ошибки и высылать нам pull-request'ы.

source: Implement a feature from the Roadmap or simply make something new.
ru: Реализовать одну из планируемых функциональностей или сделать что-то новое.

source: Support and promote the development of specific functions which are important to you and may be shared.
ru: Поддержать и продвигать разработку специфичных функциональностей, которые важны для вашей работы и могут быть полезны другим.

source: Provide testing environment for other deployment schemes. Now we interested in testing the app with
ru: Предоставить тестовое окружение для различных сценариев развертывания. В данный момент мы заинтересованы в тестировании на:

source: KVM with RBD
ru: KVM с RBD

source: Xen with NFS, Local, RBD
ru: Xen с NFS, Local, RBD

source: Oher browsers and operating systems
ru: других браузерах и операционных системах.

source: Hire us for frontend or backend development of custom software development projects. Take a look at our `website <https://bitworks.software/>`_ to know where we can be useful. Take a look at our `presentation <https://www.slideshare.net/secret/BpNGxtaPUfOIqj>`_ to learn more about us.
ru: Мы с радостью разработаем frontend или backend для ваших проектов. Больше информации о нашем опыте разработки вы найдете на `сайте <https://bitworks.software/>`_ . Также, информация о нас представлена в `презентации <https://www.slideshare.net/secret/BpNGxtaPUfOIqj>`_.

source: To contribute, just contact us via e-mail: info@bw-sw.com
ru: Для участия в проекте просто отправьте сообщение на адрес: info@bw-sw.com
